---
kind: method
id: M:Autodesk.Revit.DB.LinePatternElement.GetLinePattern
source: html/da768e39-4e08-7586-6665-95c13c69f7b4.htm
---
# Autodesk.Revit.DB.LinePatternElement.GetLinePattern Method

Gets the LinePattern associated to this element.

## Syntax (C#)
```csharp
public LinePattern GetLinePattern()
```

## Returns
A copy of LinePattern object.